onec/config/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/config/Catalogs/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Начисления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/config/Catalogs/Платежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Платежи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКопеек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/config/HTTPServices/ReconLoader/Ext/Module.bsl
// HTTP-сервис ReconLoader: загрузка fixtures/data.json и создание пользователей.
// Публикуется ТОЛЬКО на время восстановления базы (onec/restore.sh), в рабочем
// режиме ibsrv его не публикует. Дополнительно защищён правами: нужно право Администрирование.
//
// Тело запроса:
// {"fixtures": <содержимое data.json>,
//  "users": [{"name": "...", "password": "...", "role": "ПолныеПрава"}, ...]}
//
// Повторная загрузка не создаёт дублей: запись ищется по ВнешнийID и обновляется.

Функция ЗагрузитьФикстуры(ВходящийЗапрос)

	// Право «Администрирование» есть у сеанса в базе без пользователей (первичная загрузка)
	// и у пользователя с ролью ПолныеПрава. У роли ЧтениеДанных его нет.
	// (РольДоступна() не подходит: в базе без пользователей она возвращает Ложь.)
	Если Не ПравоДоступа("Администрирование", Метаданные) Тогда
		Возврат ОтветТекст(403, "Загрузка доступна только администратору");
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ВходящийЗапрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
	Тело = ПрочитатьJSON(Чтение, Истина);
	Чтение.Закрыть();

	Фикстуры = Тело["fixtures"];

	НачатьТранзакцию();
	Попытка
		Счета = Новый Соответствие; // ВнешнийID -> ссылка
		Для Каждого Данные Из Фикстуры["accounts"] Цикл
			Счета.Вставить(Данные["id"], ЗаписатьСчет(Данные));
		КонецЦикла;
		Для Каждого Данные Из Фикстуры["charges"] Цикл
			ЗаписатьНачисление(Данные, Счета);
		КонецЦикла;
		Для Каждого Данные Из Фикстуры["payments"] Цикл
			ЗаписатьПлатеж(Данные, Счета);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	// Пользователи — после данных: первый же созданный пользователь закрывает вход без пароля.
	// Администратор должен идти первым (платформа требует, чтобы первый имел право Администрирование).
	Если Тело.Получить("users") <> Неопределено Тогда
		Для Каждого Описание Из Тело["users"] Цикл
			ОбеспечитьПользователя(Описание["name"], Описание["password"], Описание["role"]);
		КонецЦикла;
	КонецЕсли;

	Возврат ОтветИтог();

КонецФункции

Функция ЗаписатьСчет(Данные)

	Объект = ОбъектПоВнешнемуID(Справочники.ЛицевыеСчета, Данные["id"]);
	Объект.НомерСчета = Данные["account_number"];
	Объект.Наименование = Данные["account_number"];
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

Процедура ЗаписатьНачисление(Данные, Счета)

	Объект = ОбъектПоВнешнемуID(Справочники.Начисления, Данные["id"]);
	Объект.ЛицевойСчет = СчетПоID(Счета, Данные["account_id"], Данные["id"]);
	Объект.Период = МесяцИзСтроки(Данные["period"]);
	Объект.СуммаКопеек = ЦелыеКопейки(Данные["amount_kopecks"], Данные["id"]);
	Объект.Наименование = Данные["id"];
	Объект.Записать();

КонецПроцедуры

Процедура ЗаписатьПлатеж(Данные, Счета)

	Объект = ОбъектПоВнешнемуID(Справочники.Платежи, Данные["id"]);
	Объект.ЛицевойСчет = СчетПоID(Счета, Данные["account_id"], Данные["id"]);
	Объект.ДатаПлатежа = ДатаИзСтроки(Данные["date"]);
	Объект.СуммаКопеек = ЦелыеКопейки(Данные["amount_kopecks"], Данные["id"]);
	Объект.Наименование = Данные["id"];
	Объект.Записать();

КонецПроцедуры

Функция ОбъектПоВнешнемуID(Менеджер, ВнешнийID)

	Если Не ЗначениеЗаполнено(ВнешнийID) Тогда
		ВызватьИсключение "Пустой id в фикстурах";
	КонецЕсли;
	Ссылка = Менеджер.НайтиПоРеквизиту("ВнешнийID", ВнешнийID);
	Если Ссылка.Пустая() Тогда
		Объект = Менеджер.СоздатьЭлемент();
		Объект.ВнешнийID = ВнешнийID;
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	Возврат Объект;

КонецФункции

Функция СчетПоID(Счета, ВнешнийID, IDЗаписи)

	Ссылка = Счета.Получить(ВнешнийID);
	Если Ссылка = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Запись %1 ссылается на неизвестный счёт %2", IDЗаписи, ВнешнийID);
	КонецЕсли;
	Возврат Ссылка;

КонецФункции

// Суммы — только целые копейки; дробное значение — ошибка загрузки, а не округление.
Функция ЦелыеКопейки(Значение, IDЗаписи)

	Если ТипЗнч(Значение) <> Тип("Число") Или Цел(Значение) <> Значение Тогда
		ВызватьИсключение СтрШаблон("Запись %1: amount_kopecks должно быть целым числом", IDЗаписи);
	КонецЕсли;
	Возврат Значение;

КонецФункции

// "2026-08" -> 01.08.2026
Функция МесяцИзСтроки(Строка)

	Если СтрДлина(Строка) <> 7 Или Сред(Строка, 5, 1) <> "-" Тогда
		ВызватьИсключение СтрШаблон("Неверный формат периода '%1', ожидается YYYY-MM", Строка);
	КонецЕсли;
	Возврат Дата(Число(Лев(Строка, 4)), Число(Сред(Строка, 6, 2)), 1);

КонецФункции

// "2026-08-20" -> 20.08.2026
Функция ДатаИзСтроки(Строка)

	Если СтрДлина(Строка) <> 10 Или Сред(Строка, 5, 1) <> "-" Или Сред(Строка, 8, 1) <> "-" Тогда
		ВызватьИсключение СтрШаблон("Неверный формат даты '%1', ожидается YYYY-MM-DD", Строка);
	КонецЕсли;
	Возврат Дата(Число(Лев(Строка, 4)), Число(Сред(Строка, 6, 2)), Число(Сред(Строка, 9, 2)));

КонецФункции

Процедура ОбеспечитьПользователя(Имя, Пароль, ИмяРоли)

	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Имя;
	КонецЕсли;
	Пользователь.ПолноеИмя = Имя;
	Пользователь.АутентификацияСтандартная = Истина;
	Пользователь.ПоказыватьВСпискеВыбора = Ложь;
	Пользователь.Пароль = Пароль;
	Пользователь.Роли.Очистить();
	Пользователь.Роли.Добавить(Метаданные.Роли[ИмяРоли]);
	Пользователь.Записать();

КонецПроцедуры

Функция ОтветИтог()

	Итог = Новый Структура;
	Итог.Вставить("accounts", КоличествоЭлементов("ЛицевыеСчета"));
	Итог.Вставить("charges", КоличествоЭлементов("Начисления"));
	Итог.Вставить("payments", КоличествоЭлементов("Платежи"));

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(Запись, Итог);

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Запись.Закрыть(), КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции

Функция КоличествоЭлементов(ИмяСправочника)

	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Количество ИЗ Справочник." + ИмяСправочника);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Количество;

КонецФункции

Функция ОтветТекст(Код, Текст)

	Ответ = Новый HTTPСервисОтвет(Код);
	Ответ.Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Текст, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции
